<a href="https://colab.research.google.com/github/Moly-malibu/data-science/blob/master/titanic_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import sqlite3
import pandas as pd
import seaborn as sns
import psycopg2

# Load the data

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module2-sql-for-analysis/titanic.csv")
df.head

<bound method NDFrame.head of      Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]>

In [0]:
df = df.rename(columns={'Siblings/Spouses Aboard': "spouses_aboard", 'Parents/Children Aboard': "parents_children_aboard"})

# Turning a DF into SQL

In [0]:
conn = sqlite3.connect("titanic.sqlite3")
df.to_sql("titanic.sqlite3", conn)

# Query the database

In [7]:
curs = conn.cursor()

query = "SELECT * FROM 'titanic.sqlite3'"

curs.execute(query).fetchall()[0]

(0, 0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25)

In [8]:
df.to_sql

<bound method NDFrame.to_sql of      Survived  Pclass  ... parents_children_aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]>

In [0]:
#Count how many rows you have - it should be 249!
df.count()

Survived                   887
Pclass                     887
Name                       887
Sex                        887
Age                        887
Spouses_aboard             887
Parents_Children_Aboard    887
Fare                       887
dtype: int64

--How many passengers survived, and how many died?

--How many passengers were in each class?

--How many passengers survived/died within each class?

--What was the average age of survivors vs nonsurvivors?

--What was the average age of each passenger class?

--What was the average fare by passenger class? By survival?

--How many siblings/spouses aboard on average, by passenger class? By survival?

--How many parents/children aboard on average, by passenger class? By survival?

--Do any passengers have the same name?

--(Bonus! Hard, may require pulling and processing with Python) How many married couples were aboard the Titanic? Assume that two people (one Mr. and one Mrs.) with the same last name and with at least 1 sibling/spouse aboard are a married couple.

In [0]:
#CREATE THE TABLE

table = """(
CREATE TABLE IF NOT EXISTS titanic_analys(
	id SERIAL PRIMARY KEY,
	survived int,
	pclass int,
	name varchar,
	sex varchar,
	age int,
	sib_spouse_count int,
	parent_child_count int,
	fare float8
)
"""

In [0]:
#How many passengers survived.
#how many died?

#total pasangers >887
#SURVIVED > 345
#DIED > 545

query = "SELECT COUNT (*) FROM 'titanic_passangers' WHERE survived = '0', '1'"
result = sqlite3_curs.execute(query).fetchall()[0][0]
print(f'The number of Passengers survived')

In [0]:
#How many passengers were in each class?
#passangers by class 1 > 216
#passangers by class 2 > 184
#passangers by class 3 > 487

SELECT COUNT (*) FROM titanic_passangers
WHERE Pclass = '3';

In [0]:
#How many passengers survived/died within each class?
#passangers by class 1 survived > 136
#passangers by class 1 died > 80

#passangers by class 2 survived > 87
#passangers by class 2 died > 97

#passangers by class 3 survived > 119
#passangers by class 3 died > 368

SELECT COUNT (*) FROM titanic_passangers
	WHERE Pclass = '3'
	AND survived = '1';

In [0]:
#What was the average age of survivors vs nonsurvivors?
#average age by survivors > 28.41
#average age by nonsurvivors > 30.15

SELECT AVG(age) 
FROM titanic_passangers 
WHERE survived = '0'

In [0]:
#What was the average age of each passenger class?
#average age by class 1 > 38.79
#average age by class 2 > 29.88
#average age by class 3 > 25.20

SELECT AVG(age) 
FROM titanic_passangers 
WHERE pclass = '3'

In [0]:
#What was the average fare by passenger class? By survival?

#average fare by class by survival 1 > 35.96
#average fare by class by survival 2 > 26.18
#average fare by class by survival 3 > 21.41

SELECT AVG(age) 
	FROM titanic_passangers 
	WHERE pclass = '3'
	AND survived = '1'

In [0]:
#How many siblings/spouses aboard on average, by passenger class? By survival?

#average spouse aboard by passenger by survival 1 >  0.4926
#average spouse aboard by passenger by survival 2 >  0.4942
#average spouse aboard by passenger by survival 3 >  0.4396

SELECT AVG(spouses_aboard) 
	FROM titanic_passangers 
	WHERE pclass = '3'
	AND survived = '1'

In [0]:
#How many parents/children aboard on average, by passenger class? By survival?

#average arents_children_aboard by passenger by survival 1 >  0.3897
#average arents_children_aboard by passenger by survival 2 >  0.64
#average arents_children_aboard by passenger by survival 3 >  0.4220

SELECT AVG(parents_children_aboard) 
	FROM titanic_passangers 
	WHERE pclass = '3'
	AND survived = '1'

In [0]:
#Do any passengers have the same name?
#passengers by same name > 202

SELECT name, COUNT(NAME)
	FROM titanic_passangers
	GROUP BY NAME
	ORDER BY NAME

In [0]:
#(Bonus! Hard, may require pulling and processing with Python) How many married couples were aboard the Titanic? Assume that two people (one Mr. and one Mrs.) 
#with the same last name and with at least 1 sibling/spouse aboard are a married couple.


#how many married by Mr and Mrs. > 214  

#spouse aboard (4) > 18
#spouse aboard (3) > 16
#spouse aboard (1) > 209
#spouse aboard (0) > 604

#parent board (4) > = 4
#parent board (1) > = 118
#parent board (2) > = 80
#parent board (0) > = 674


SELECT COUNT(spouses_aboard) 
FROM titanic_passangers 
WHERE spouses_aboard = '4'
	
SELECT COUNT(parents_children_aboard) 
FROM titanic_passangers 
WHERE parents_children_aboard = '4'

SELECT name, COUNT(NAME)
	FROM titanic_passangers	
	GROUP BY NAME
	ORDER BY NAME = 'Mirs'
	
SELECT *
	FROM titanic_passangers
	ORDER BY NAME, NAME;

In [0]:
df

     Survived  Pclass  ... Parents_Children_Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]